_posts/2019-07-24-maximum-likelihood-estimation-with-tensorflow-probability-and-stan-take-2.html
---
layout: post
title: "Maximum likelihood estimation with tensorflow probability and stan take 2"
permalink: /:title/
tags: [tensorflow, rstan]
---

<p>
After a <a href="https://jeffpollock9.github.io/maximum-likelihood-estimation-with-tensorflow-probability-and-pystan/">previous post</a> there has been some discussion on the <a href="https://discourse.mc-stan.org/t/any-way-to-make-stan-competitive-with-tensorflow-for-maximum-likelihood/8230">stan forums</a> so I thought I
would have another bash at seeing how fast I can make tensorflow and stan find maximum
likelihood estimates for a fairly large problem.
</p>

<p>
I'm using specialised functions for fitting GLMs, namely <a href="https://mc-stan.org/docs/2_19/functions-reference/bernoulli-logit-glm.html">bernoulli<sub>logit</sub><sub>glm</sub></a> in stan and
<a href="https://www.tensorflow.org/probability/api_docs/python/tfp/glm/fit">tfp.glm.fit</a> in tensorflow. Both of these make the code faster and easier to understand
than the previous post. Win.
</p>

<p>
In order to make the tensorflow version as fast as possible, I call it twice, the first
call creates a graph and I don't want to time that:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> tensorflow_probability <span style="color: #F0DFAF; font-weight: bold;">as</span> tfp
<span style="color: #F0DFAF; font-weight: bold;">import</span> tensorflow <span style="color: #F0DFAF; font-weight: bold;">as</span> tf
<span style="color: #F0DFAF; font-weight: bold;">import</span> time <span style="color: #F0DFAF; font-weight: bold;">as</span> tm

<span style="color: #DFAF8F;">tfd</span> = tfp.distributions
<span style="color: #DFAF8F;">tfl</span> = tf.linalg

<span style="color: #DFAF8F;">N</span> = 1_000_000
<span style="color: #DFAF8F;">P</span> = 250


<span style="color: #7CB8BB;">@tf.function</span>(
    autograph=<span style="color: #BFEBBF;">False</span>,
    input_signature=[
        tf.TensorSpec(shape=tf.TensorShape([N, P + 1]), dtype=tf.float32),
        tf.TensorSpec(shape=tf.TensorShape([N]), dtype=tf.float32),
    ],
)
<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">fit</span>(model_matrix, response):
    <span style="color: #F0DFAF; font-weight: bold;">return</span> tfp.glm.fit(
        model_matrix=model_matrix, response=response, model=tfp.glm.Bernoulli()
    )


tf.random.set_seed(123)

<span style="color: #DFAF8F;">alpha_true</span> = tfd.Normal(loc=0.666, scale=1.0).sample()
<span style="color: #DFAF8F;">beta_true</span> = tfd.Normal(loc=0.0, scale=3.14).sample(P)

<span style="color: #DFAF8F;">x</span> = tfd.Normal(loc=0.0, scale=1.0).sample([N, P])
<span style="color: #DFAF8F;">y</span> = tfd.Bernoulli(alpha_true + tfl.matvec(x, beta_true), dtype=x.dtype).sample()

<span style="color: #DFAF8F;">model_matrix</span> = tf.concat([tf.ones([N, 1]), x], axis=1)

<span style="color: #DFAF8F;">_</span> = fit(model_matrix, y)

<span style="color: #DFAF8F;">start</span> = tm.time()
<span style="color: #DFAF8F;">mle</span>, <span style="color: #DFAF8F;">linear_response</span>, <span style="color: #DFAF8F;">is_converged</span>, <span style="color: #DFAF8F;">num_iterations</span> = fit(model_matrix, y)
<span style="color: #DFAF8F;">end</span> = tm.time()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(f<span style="color: #CC9393;">"tf version: {tf.__version__}, tfp version: {tfp.__version__}"</span>)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(f<span style="color: #CC9393;">"tf took: {end - start:.4f} seconds"</span>)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(f<span style="color: #CC9393;">"converged: {is_converged}"</span>)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(f<span style="color: #CC9393;">"iterations: {num_iterations}"</span>)
</pre>
</div>

<pre class="example">
tf version: 2.0.0-dev20190724, tfp version: 0.8.0-dev20190724
tf took: 2.1767 seconds
converged: True
iterations: 15

</pre>

<p>
Here's the rstan version:
</p>

<div class="org-src-container">
<pre class="src src-stan" id="org55a7d86"><span style="color: #F0DFAF; font-weight: bold;">data</span> {
    <span style="color: #7CB8BB;">int</span>&lt;<span style="color: #F0DFAF; font-weight: bold;">lower</span> <span style="color: #BFEBBF;">=</span> 0&gt; <span style="color: #DFAF8F;">N</span>;
    <span style="color: #7CB8BB;">int</span>&lt;<span style="color: #F0DFAF; font-weight: bold;">lower</span> <span style="color: #BFEBBF;">=</span> 0&gt; <span style="color: #DFAF8F;">P</span>;
    <span style="color: #7CB8BB;">matrix</span>[N, P] <span style="color: #DFAF8F;">x</span>;
    <span style="color: #7CB8BB;">int</span>&lt;<span style="color: #F0DFAF; font-weight: bold;">lower</span> <span style="color: #BFEBBF;">=</span> 0, <span style="color: #F0DFAF; font-weight: bold;">upper</span> <span style="color: #BFEBBF;">=</span> 1&gt; <span style="color: #DFAF8F;">y</span>[N];
}

<span style="color: #F0DFAF; font-weight: bold;">parameters</span> {
    <span style="color: #7CB8BB;">real</span> <span style="color: #DFAF8F;">alpha</span>;
    <span style="color: #7CB8BB;">vector</span>[P] <span style="color: #DFAF8F;">beta</span>;
}

<span style="color: #F0DFAF; font-weight: bold;">model</span> {
    y <span style="color: #BFEBBF;">~</span> bernoulli_logit_glm_lpmf(x, alpha, beta);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np

np.savetxt(<span style="color: #CC9393;">"misc/x.csv"</span>, x.numpy(), delimiter=<span style="color: #CC9393;">","</span>)
np.savetxt(<span style="color: #CC9393;">"misc/y.csv"</span>, y.numpy(), delimiter=<span style="color: #CC9393;">","</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #BFEBBF;">library</span>(rstan)
<span style="color: #BFEBBF;">library</span>(data.table)
<span style="color: #BFEBBF;">library</span>(tictoc)

rstan_options(auto_write = <span style="color: #7CB8BB;">TRUE</span>)

x <span style="color: #BFEBBF;">&lt;-</span> as.matrix(fread(<span style="color: #CC9393;">"misc/x.csv"</span>, header = <span style="color: #7CB8BB;">FALSE</span>))
y <span style="color: #BFEBBF;">&lt;-</span> fread(<span style="color: #CC9393;">"misc/y.csv"</span>, header = <span style="color: #7CB8BB;">FALSE</span>)[[1]]

stan_data <span style="color: #BFEBBF;">&lt;-</span> list(N = nrow(x), P = ncol(x), x = x, y = y)

model <span style="color: #BFEBBF;">&lt;-</span> stan_model(stan_file)

tic(paste(<span style="color: #CC9393;">"rstan version:"</span>, packageVersion(<span style="color: #CC9393;">"rstan"</span>)))
fit <span style="color: #BFEBBF;">&lt;-</span> optimizing(model, data = stan_data, hessian = <span style="color: #7CB8BB;">FALSE</span>)
toc()

fwrite(data.table(fit$par), <span style="color: #CC9393;">"misc/rstan-take-2.csv"</span>, col.names = <span style="color: #7CB8BB;">FALSE</span>)
</pre>
</div>

<pre class="example">
rstan version: 2.19.2: 11.213 sec elapsed

</pre>

<p>
Which is pretty impressive running on a single core!
</p>

<p>
As before, let's check the results:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> pandas <span style="color: #F0DFAF; font-weight: bold;">as</span> pd

<span style="color: #DFAF8F;">true_vector</span> = np.concatenate(
    [np.expand_dims(alpha_true.numpy(), 0), np.squeeze(beta_true.numpy())], 0
)

<span style="color: #DFAF8F;">estimates</span> = pd.DataFrame(
    {
        <span style="color: #CC9393;">"true"</span>: true_vector,
        <span style="color: #CC9393;">"tf2"</span>: mle.numpy(),
        <span style="color: #CC9393;">"rstan"</span>: np.genfromtxt(<span style="color: #CC9393;">"misc/rstan-take-2.csv"</span>, delimiter=<span style="color: #CC9393;">","</span>),
    },
    index=[<span style="color: #CC9393;">"alpha"</span>, *[f<span style="color: #CC9393;">"beta[{i}]"</span> <span style="color: #F0DFAF; font-weight: bold;">for</span> i <span style="color: #F0DFAF; font-weight: bold;">in</span> <span style="color: #DCDCCC; font-weight: bold;">range</span>(P)]],
)

estimates.sample(10).<span style="color: #DCDCCC; font-weight: bold;">round</span>(6)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">true</th>
<th scope="col" class="org-right">tf2</th>
<th scope="col" class="org-right">rstan</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">beta[168]</td>
<td class="org-right">-1.00876</td>
<td class="org-right">-1.04356</td>
<td class="org-right">-1.02366</td>
</tr>

<tr>
<td class="org-left">beta[204]</td>
<td class="org-right">2.89247</td>
<td class="org-right">2.93403</td>
<td class="org-right">2.87811</td>
</tr>

<tr>
<td class="org-left">beta[148]</td>
<td class="org-right">3.16335</td>
<td class="org-right">3.23323</td>
<td class="org-right">3.17151</td>
</tr>

<tr>
<td class="org-left">beta[212]</td>
<td class="org-right">0.851386</td>
<td class="org-right">0.871118</td>
<td class="org-right">0.854402</td>
</tr>

<tr>
<td class="org-left">beta[207]</td>
<td class="org-right">-0.999736</td>
<td class="org-right">-1.03336</td>
<td class="org-right">-1.0136</td>
</tr>

<tr>
<td class="org-left">beta[87]</td>
<td class="org-right">-6.39461</td>
<td class="org-right">-6.52071</td>
<td class="org-right">-6.3964</td>
</tr>

<tr>
<td class="org-left">beta[5]</td>
<td class="org-right">2.60261</td>
<td class="org-right">2.6781</td>
<td class="org-right">2.62696</td>
</tr>

<tr>
<td class="org-left">beta[209]</td>
<td class="org-right">3.11193</td>
<td class="org-right">3.18115</td>
<td class="org-right">3.12059</td>
</tr>

<tr>
<td class="org-left">beta[123]</td>
<td class="org-right">2.1765</td>
<td class="org-right">2.22263</td>
<td class="org-right">2.18031</td>
</tr>

<tr>
<td class="org-left">beta[75]</td>
<td class="org-right">-4.83231</td>
<td class="org-right">-4.92313</td>
<td class="org-right">-4.82925</td>
</tr>
</tbody>
</table>
